================================================================================
Empty equation
================================================================================
$$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation)))

================================================================================
Shorthand
================================================================================
$-> ~~>$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_shorthand)
        (space)
        (math_shorthand)))))

================================================================================
Delimited, non-shorthand
================================================================================
$⟪x⟫$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          (math
            (math_text)))))))

================================================================================
Delimited, shorthand
================================================================================
$[|x|]$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_shorthand)
          (math
            (math_text))
          right: (math_shorthand))))))


================================================================================
Delimited, non-matching
================================================================================
$[|x⟫$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited
          left: (math_shorthand)
          (math
            (math_text)))))))

================================================================================
Delimited, fenced
================================================================================
$||x||$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_delimited_fence
          left: (math_shorthand)
          (math
            (math_text))
          right: (math_shorthand))))))

================================================================================
Linebreak
================================================================================
$\ $
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (linebreak)))))

================================================================================
Math align point
================================================================================
$&$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_align_point)))))

================================================================================
Escape
================================================================================
$\u{FFEF}$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (escape)))))

================================================================================
String
================================================================================
$"hello \" world"$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (string)))))

================================================================================
Field access
================================================================================
$dot.c$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_field_access
          (math_ident)
          (math_ident))))))

================================================================================
Field access, multiple
================================================================================
$dot.h.c$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_field_access
          (math_ident)
          (math_ident)
          (math_ident))))))

================================================================================
Field access, trailing number
================================================================================
$foo.5.5$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_field_access
          (math_ident)
          (math_ident))))))

================================================================================
Field access, trailing grapheme
================================================================================
$foo.♥$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_field_access
          (math_ident)
          (math_ident))))))

================================================================================
Function call, no arguments
================================================================================
$sqrt()$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident)))))))

================================================================================
Function call, empty argument
================================================================================
$sqrt(,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args))))))

================================================================================
Function call, one argument
================================================================================
$sqrt(5)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, one argument, trailing comma
================================================================================
$sqrt(5,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, two arguments
================================================================================
$foo(1, 2)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (space)
            (math
              (math_text))))))))

================================================================================
Function call, two arguments, trailing comma
================================================================================
$foo(1, 2,)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (space)
            (math
              (math_text))))))))

================================================================================
Function call, one named argument
================================================================================
$foo(bar:5)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          (math_field_access
            (math_ident))
          args: (math_args
            (math_arg_named
              name: (math_ident)
              arg: (math
                (math_text)))))))))

================================================================================
Function call, one named argument without value
================================================================================
$foo(bar:)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          (math_field_access
            (math_ident))
          args: (math_args
            (math_arg_named
              name: (math_ident))))))))

================================================================================
Function call, one unnamed argument, then one named argument
================================================================================
$foo(0, bar: 1)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      inner: (math
        (math_function_call
          (math_field_access
            (math_ident))
          args: (math_args
            (math
              (math_text))
            (space)
            (math_arg_named
              name: (math_ident)
              (space)
              arg: (math
                (math_text)))))))))

================================================================================
Function call, empty array
================================================================================
$foo(;)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args))))))

================================================================================
Function call, one array
================================================================================
$foo(1;)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))))))))

================================================================================
Function call, trailing array
================================================================================
$mat(1, 2; 3, 4)$
--------------------------------------------------------------------------------

(source_file
  (markup
    (equation
      (math
        (math_function_call
          (math_field_access
            (math_ident))
          (math_args
            (math
              (math_text))
            (space)
            (math
              (math_text))
            (space)
            (math
              (math_text))
            (space)
            (math
              (math_text))))))))
